betaflight/betaflight/src/platform/STM32/bus_spi_ll.c
    if (bus->dmaRx) {
        LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

        LL_DMA_StructInit(dmaInitRx);
#if defined(STM32G4) || defined(STM32H7)
        dmaInitRx->PeriphRequest = bus->dmaRx->channel;
#else
        dmaInitRx->Channel = bus->dmaRx->channel;
#endif
        dmaInitRx->Mode = LL_DMA_MODE_NORMAL;
        dmaInitRx->Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
#if defined(STM32H7)
        dmaInitRx->PeriphOrM2MSrcAddress = (uint32_t)&instance->RXDR;
#else
        dmaInitRx->PeriphOrM2MSrcAddress = (uint32_t)&instance->DR;
#endif
        dmaInitRx->Priority = LL_DMA_PRIORITY_MEDIUM;
        dmaInitRx->PeriphOrM2MSrcIncMode  = LL_DMA_PERIPH_NOINCREMENT;
        dmaInitRx->PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE;
    }
#endif // !STM32N6
}

void spiInternalResetStream(dmaChannelDescriptor_t *descriptor)
{
    // Disable the stream
#if defined(STM32G4) || defined(STM32H5) || defined(STM32N6)
    LL_DMA_DisableChannel(descriptor->dma, descriptor->stream);
    while (LL_DMA_IsEnabledChannel(descriptor->dma, descriptor->stream));
#else
    LL_DMA_DisableStream(descriptor->dma, descriptor->stream);
    while (LL_DMA_IsEnabledStream(descriptor->dma, descriptor->stream));
#endif

    // Clear any pending interrupt flags
    DMA_CLEAR_FLAG(descriptor, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);
}

FAST_CODE bool spiInternalReadWriteBufPolled(spiResource_t *spiInstance, const uint8_t *txData, uint8_t *rxData, int len)
{
    SPI_TypeDef *instance = (SPI_TypeDef *)spiInstance;
#if defined(STM32H7) || defined(STM32H5) || defined(STM32N6)
    LL_SPI_SetTransferSize(instance, len);
    LL_SPI_Enable(instance);
    LL_SPI_StartMasterTransfer(instance);
    while (len) {
        while (!LL_SPI_IsActiveFlag_TXP(instance));
        uint8_t b = txData ? *(txData++) : 0xFF;
        LL_SPI_TransmitData8(instance, b);

        while (!LL_SPI_IsActiveFlag_RXP(instance));
        b = LL_SPI_ReceiveData8(instance);
        if (rxData) {
            *(rxData++) = b;
        }
        --len;
    }
    while (!LL_SPI_IsActiveFlag_EOT(instance));
    LL_SPI_ClearFlag_TXTF(instance);
    LL_SPI_Disable(instance);
#else
    // set 16-bit transfer
    CLEAR_BIT(instance->CR2, SPI_RXFIFO_THRESHOLD);
    while (len > 1) {
        while (!LL_SPI_IsActiveFlag_TXE(instance));
        uint16_t w;
        if (txData) {
            w = *((uint16_t *)txData);
            txData += 2;
        } else {
            w = 0xFFFF;
        }
        LL_SPI_TransmitData16(instance, w);

        while (!LL_SPI_IsActiveFlag_RXNE(instance));
        w = LL_SPI_ReceiveData16(instance);
        if (rxData) {
            *((uint16_t *)rxData) = w;
            rxData += 2;
        }
        len -= 2;
    }
    // set 8-bit transfer
    SET_BIT(instance->CR2, SPI_RXFIFO_THRESHOLD);
    if (len) {
        while (!LL_SPI_IsActiveFlag_TXE(instance));
        uint8_t b = txData ? *(txData++) : 0xFF;
        LL_SPI_TransmitData8(instance, b);

        while (!LL_SPI_IsActiveFlag_RXNE(instance));
        b = LL_SPI_ReceiveData8(instance);
        if (rxData) {
            *(rxData++) = b;
        }
        --len;
    }
#endif

    return true;
}

void spiInternalInitStream(const extDevice_t *dev, volatile busSegment_t *segment)
{
#if defined(STM32H5)
    STATIC_DMA_DATA_AUTO uint8_t dummyTxByte = 0xff;
    STATIC_DMA_DATA_AUTO uint8_t dummyRxByte;
    busDevice_t *bus = dev->bus;
    int len = segment->len;

    uint8_t *txData = segment->u.buffers.txData;
    LL_DMA_InitTypeDef *dmaInitTx = bus->dmaInitTx;

    if (txData) {
        dmaInitTx->SrcAddress = (uint32_t)txData;
        dmaInitTx->SrcIncMode = LL_DMA_SRC_INCREMENT;
    } else {
        dmaInitTx->SrcAddress = (uint32_t)&dummyTxByte;
        dmaInitTx->SrcIncMode = LL_DMA_SRC_FIXED;
    }
    dmaInitTx->BlkDataLength = len;

    uint8_t *rxData = segment->u.buffers.rxData;
    LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

    if (rxData) {
        dmaInitRx->DestAddress = (uint32_t)rxData;
        dmaInitRx->DestIncMode = LL_DMA_DEST_INCREMENT;
    } else {
        dmaInitRx->DestAddress = (uint32_t)&dummyRxByte;
        dmaInitRx->DestIncMode = LL_DMA_DEST_FIXED;
    }
    dmaInitRx->BlkDataLength = len;
#elif defined(STM32N6)
    // TODO: GPDMA uses a completely different LL_DMA API; SPI DMA not yet supported
    UNUSED(dev);
    UNUSED(segment);
#else
    STATIC_DMA_DATA_AUTO uint8_t dummyTxByte = 0xff;
    STATIC_DMA_DATA_AUTO uint8_t dummyRxByte;
    busDevice_t *bus = dev->bus;
    int len = segment->len;

    uint8_t *txData = segment->u.buffers.txData;
    LL_DMA_InitTypeDef *dmaInitTx = bus->dmaInitTx;

    if (txData) {
#ifdef __DCACHE_PRESENT
#ifdef STM32H7
        if ((txData < &_dmaram_start__) || (txData >= &_dmaram_end__)) {
#else
        // No need to flush DTCM memory
        if (!IS_DTCM(txData)) {
#endif
            // Flush the D cache to ensure the data to be written is in main memory
            SCB_CleanDCache_by_Addr(
                    (uint32_t *)((uint32_t)txData & ~CACHE_LINE_MASK),
                    (((uint32_t)txData & CACHE_LINE_MASK) + len - 1 + CACHE_LINE_SIZE) & ~CACHE_LINE_MASK);
        }
#endif // __DCACHE_PRESENT
        dmaInitTx->MemoryOrM2MDstAddress = (uint32_t)txData;
        dmaInitTx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    } else {
        dmaInitTx->MemoryOrM2MDstAddress = (uint32_t)&dummyTxByte;
        dmaInitTx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_NOINCREMENT;
    }
    dmaInitTx->NbData = len;

#if !defined(STM32G4) && !defined(STM32H7)
    if (dev->bus->dmaRx) {
#endif
        uint8_t *rxData = segment->u.buffers.rxData;
        LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

        if (rxData) {
            /* Flush the D cache for the start and end of the receive buffer as
             * the cache will be invalidated after the transfer and any valid data
             * just before/after must be in memory at that point
             */
#ifdef __DCACHE_PRESENT
            // No need to flush/invalidate DTCM memory
#ifdef STM32H7
            if ((rxData < &_dmaram_start__) || (rxData >= &_dmaram_end__)) {
#else
            // No need to flush DTCM memory
            if (!IS_DTCM(rxData)) {
#endif
                SCB_CleanInvalidateDCache_by_Addr(
                        (uint32_t *)((uint32_t)rxData & ~CACHE_LINE_MASK),
                        (((uint32_t)rxData & CACHE_LINE_MASK) + len - 1 + CACHE_LINE_SIZE) & ~CACHE_LINE_MASK);
            }
#endif // __DCACHE_PRESENT
        dmaInitRx->MemoryOrM2MDstAddress = (uint32_t)rxData;
        dmaInitRx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    } else {
        dmaInitRx->MemoryOrM2MDstAddress = (uint32_t)&dummyRxByte;
        dmaInitRx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_NOINCREMENT;
    }
    dmaInitRx->NbData = len;
#if !defined(STM32G4) && !defined(STM32H7)
    }
#endif
#endif // !STM32N6
}

void spiInternalStartDMA(const extDevice_t *dev)
{
#if defined(STM32H5)
    busDevice_t *bus = dev->bus;
    SPI_TypeDef *instance = (SPI_TypeDef *)bus->busType_u.spi.instance;

    dmaChannelDescriptor_t *dmaTx = bus->dmaTx;
    dmaChannelDescriptor_t *dmaRx = bus->dmaRx;

    // Use the correct callback argument
    dmaRx->userParam = (uint32_t)dev;

    // Clear transfer flags
    DMA_CLEAR_FLAG(dmaTx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);
    DMA_CLEAR_FLAG(dmaRx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);

    // Disable channels to enable update
    LL_DMA_DisableChannel(dmaTx->dma, dmaTx->stream);
    LL_DMA_DisableChannel(dmaRx->dma, dmaRx->stream);

    // Use the Rx interrupt as this occurs once the SPI operation is complete
    LL_DMA_EnableIT_TC(dmaRx->dma, dmaRx->stream);

    // Update channels
    LL_DMA_Init(dmaTx->dma, dmaTx->stream, bus->dmaInitTx);
    LL_DMA_Init(dmaRx->dma, dmaRx->stream, bus->dmaInitRx);

